{
    "version": "1.7.4",
    "announcements": [
        {
            "id" : 2,
            "title": "Random Map Survival is out of beta!",
            "description": "In addition to the new MXRandom update, the survival mode has been completely revised.\n\n [Link to the video](https://www.youtube.com/watch?v=sFgqzVOIEuY) The survival mode is a mode that was released on September 9, the goal is to have as much author time as possible, the more you have, the more time you have left. But beware of skips, the more you have, the less time you have left.\n\nDespite some prowess made by some pros (we saw you Scrapie), Flink has decided that it will be a little more complicated.\n\nHere are the new rules for survival mode:\n- We start with a 15 minute timer\n- Each time we complete a map with an Author time, we gain 3 minutes on the timer\n- But with each skip, we lose 2 minutes\n- We cannot exceed 15 minutes, that means if we are at 14 minutes and we gain 3 minutes, we will not be at 17 minutes but at 15 minutes automatically\n- At each skip we lose 1 minute of its maximum, that means that if we have 1 skip and we win after an author time and the timer is at 13 minutes, we will not be at 15 but at 14. For 2 skips we will be at 13 minutes, 3 skips 12 minutes etc... This will give us a total of 15 skips maximum on a whole survival run.\n- In order not to put you in trouble, if the timer is below 2 minutes and you want to skip, you will automatically return to 2 minutes of remaining time (if the maximum is not below 2 minutes).\n\nAs you have seen in the title. The survival mode is out of its beta mode, the scoreboard has been reset.\n\n## Good Luck and Have Fun!"
        }
    ],
    "changelog": [
        {
            "title": "Version 1.7.4",
            "version": "1.7.4",
            "changes": [
                {
                    "title": "Remove skip notification on first map if show skip is disabled",
                    "type": "issue",
                    "githubIssueId": 33
                },
                {
                    "title": "Remove skip button if goal time got",
                    "type": "issue",
                    "githubIssueId": 34
                },
                {
                    "title": "Remove the 'open the overlay' text when got a goal medal with the auto skip disabled",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.7.3",
            "version": "1.7.3",
            "changes": [
                {
                    "title": "Added an option to enable or disable access to announcements API",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Fix a bug that the map switches after clicking on stop RMC",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.7.2",
            "version": "1.7.2",
            "changes": [
                {
                    "title": "Fixing a RMC rule",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.7.1",
            "version": "1.7.1",
            "changes": [
                {
                    "title": "Fixing start timer after the 3,2,1 countdown on Next",
                    "type": "pull",
                    "githubIssueId": 31
                }
            ]
        },
        {
            "title": "Version 1.7",
            "version": "1.7",
            "changes": [
                {
                    "title": "Added the announcements and changelog panel",
                    "type": "pull",
                    "githubIssueId": 28
                },
                {
                    "title": "Updated new rules on Random Map Challenge and Survival (check the new rules!)",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Removing Arena maps from search (Also called 'Police Chase', a new mode released on the Playground Club!)",
                    "type": "issue",
                    "githubIssueId": 29
                    
                },
                {
                    "title": "Disable play/pause button when not in a map",
                    "type": null,
                    "githubIssueId": null
                    
                },
                {
                    "title": "Hide RMC Mode Setting and add buttons Challenge and Survival on the same menu",
                    "type": null,
                    "githubIssueId": null
                    
                },
                {
                    "title": "Added more logging during RMC",
                    "type": null,
                    "githubIssueId": null
                    
                },
                {
                    "title": "Added Show buttons on overlay hidden (requires at least Openplanet 1.20.0)",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Added Dev Mode (if the plugin is in a folder and not in a .op file)",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Fixing a rare crash in UI",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Minor bug fixes",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.6",
            "version": "1.6",
            "changes": [
                {
                    "title": "Fix medal names being numbers",
                    "type": null,
                    "githubIssueId": null
                    
                },
                {
                    "title": "Check if the map is correct while the timer runs (timer is in pause if the map does not match the first map in recent list)",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Using Ghosts to get the correct time",
                    "type": "issue",
                    "githubIssueId": 20
                },
                {
                    "title": "Prevent loading CharacterPilot maps on RMC",
                    "type": "pull",
                    "githubIssueId": 24
                },
                {
                    "title": "Remove AT >5min text on survival free skip text",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Fixed crash by adding a condition on UISequence",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Add survival total time",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Add icons on buttons",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Minor changes ang bug fixes",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.5",
            "version": "1.5",
            "changes": [
                {
                    "title": "Add delta time removal on get medals on Next",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Replace Digital-7 Regular to Digital-7 Monospace",
                    "type": "issue",
                    "githubIssueId": 10
                },
                {
                    "title": "Gold medal notification appears now only on Challenge mode",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Pause timer when skipping the map and adding a pause timer button",
                    "type": "issue",
                    "githubIssueId": 14
                },
                {
                    "title": "Fixed typo and color in notifications",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Change font and size on medals counters to be more clear",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Remove timer end sound",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Fixed performance loss causing by currently played map on timer UI",
                    "type": "issue",
                    "githubIssueId": 18
                },
                {
                    "title": "Add medal setting for beginners",
                    "type": "issue",
                    "githubIssueId": 17
                }
            ]
        },
        {
            "title": "Version 1.4.1",
            "version": "1.4.1",
            "changes": [
                {
                    "title": "Fixed a lot of bugs on the timer on 2020",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.4",
            "version": "1.4",
            "changes": [
                {
                    "title": "Added the RMC timer and automatic medals counter. When you got gold, you can skip and add a gold on the counter. When you got AT, it skips automatically (setting enabled by default).",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Added Random Map Survival timer",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.3",
            "version": "1.3",
            "changes": [
                {
                    "title": "Fixed loading Royal maps but it's unsupported. Now it will load only normal race maps",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Added Minimal window mode, it keeps only the button",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Added width setting on the window",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.2.2",
            "version": "1.2.2",
            "changes": [
                {
                    "title": "Fixed TM2020 UI first letter missing on length and style",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Removed konami code becauses it causes a lot of problems",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.2.1",
            "version": "1.2.1",
            "changes": [
                {
                    "title": "Added map style and map Awards from TMX API to the Recently played maps list",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Awards count will not be automatically updated, the count is taken from when you add the map to the list!",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.2",
            "version": "1.2",
            "changes": [
                {
                    "title": "Added selected map style and length to the UI",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Add play specific map with its ID",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Fix bug that TM2020 does not had a play button on recent list",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Updated search method! Now all parameters (including style and length) will be on the server side",
                    "type": null,
                    "githubIssueId": null
                },
                {
                    "title": "Add a secret easy konami code to start searching without opening UI :eyes:",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        },
        {
            "title": "Version 1.1",
            "version": "1.1",
            "changes": [
                {
                    "title": "Add a menu, you can now search a map and list recents maps played from here",
                    "type": null,
                    "githubIssueId": null
                }
            ]
        }
    ],
    "rules": {
        "challenge": [
            "**Get as many Author medals as possible in 60 minutes!**",
            "You can have one free skip per run",
            "As soon as you get the Gold medal you are allowed to skip the map.",
            "If the Author Time (AT) of the map is over 3 minutes, you can skip.",
            "If the map has an impossible Author time, you can skip. (e.g. broken PF maps or cheated validation.)",
            "Ghosts other than personal best are not allowed but GPS is allowed (to not give club members an advantage).",
            "Cam 7 is allowed while the timer runs.",
            "If you have already beaten Gold medal time or AT before (also on own maps), beat the respective time again. It is highly recommended to use a medals window plugin in Openplanet to see the medal times. The checkpoint counter plugin is also allowed.",
            "You can skip Skin/Mod downloads. (Turning off will not affect since you're in solo and not in server)"
        ],
        "survival": [
            "**Finish as many Author times before the timer runs out!**",
            "**An author time adds 3 minutes to the timer.**",
            "**Maximum timer is set at 15 minutes. Skipping removes one minute to its maximum.**",
            "You can pause the timer anytime you want, as long as the pause is recorded",
            "If the map has an impossible Author time, you can use the free skip. (e.g. broken PF maps or cheated validation.)",
            "Ghosts other than personal best are not allowed but GPS is allowed (to not give club members an advantage).",
            "Cam 7 is allowed while the timer runs.",
            "If you have already beaten Gold medal time or AT before (also on own maps), beat the respective time again. It is highly recommended to use a medals window plugin in Openplanet to see the medal times.",
            "You can skip Skin/Mod downloads. (Turning off will not affect since you're in solo and not in server)"
        ]
    }
}
